"use client";
import React, { useState } from "react";

function Test() {
  // const [inputText, setInputText] = useState("");
  const [parsedOrders, setParsedOrders] = useState([]);

  const inputText = `[2/28, 12:56 PM] Sanaullah: [2/28, 11:39 AM] Sanaullah: নুরুল আমিন
 ঠিকানা ওসমানিয়া ফুলের গোড়া চট্টগ্রাম মোবাইল নাম্বার০১৬১৫৮৫৫২২২
P 590
[2/28, 11:42 AM] Sanaullah: নাম:বিপ্লব 
থানা:সাভার মডেল থানা
ঠিকানা:সাভার বক্তারপুর আকসা জামে মসজিদ 
নাম্বার:01742744516
P 590
[2/28, 12:57 PM] Sanaullah: [2/28, 12:46 AM] Sanaullah: মোঃ আল আমিন 
থানা মেঘনা জেলা কুমিল্লা গ্ৰাম ভাওর খোলা তোতা মার্কেট সংলগ্ন 01624611763
P 590
[2/28, 12:48 AM] Sanaullah: রাফি
সিলেট দক্ষিণ সুরমা জালালপুর  বাজার,
01602205329
P 590
[2/28, 5:04 AM] Sanaullah: নাম জুবায়েরের আহমদ 
জেলা : নরসিংদী 
থানা : মনোহরদা
গ্রাম: খিদিরপুর 
নাম্বার : 01310703693
P 590
[2/28, 12:57 PM] Sanaullah: [2/28, 12:37 AM] Sanaullah: নাম মোহাম্মদ আলাউদ্দীন
  ঠিকানা ফটিকছড়ি জেলা চট্টগ্রাম থানা ফটিকছড়ি বিবি হাট বাজার বাস-স্টেশন৷  ০১৮৫৩৩৬৮১৬০
P 590
[2/28, 12:46 AM] Sanaullah: মোঃ আল আমিন 
থানা মেঘনা জেলা কুমিল্লা গ্ৰাম ভাওর খোলা তোতা মার্কেট সংলগ্ন 01624611763
P 590
[2/28, 12:48 AM] Sanaullah: রাফি
সিলেট দক্ষিণ সুরমা জালালপুর  বাজার,
01602205329
P 590
[2/28, 5:04 AM] Sanaullah: নাম জুবায়েরের আহমদ 
জেলা : নরসিংদী 
থানা : মনোহরদা
গ্রাম: খিদিরপুর 
নাম্বার : 01310703693
P 590
[2/28, 11:39 AM] Sanaullah: নুরুল আমিন
 ঠিকানা ওসমানিয়া ফুলের গোড়া চট্টগ্রাম মোবাইল নাম্বার০১৬১৫৮৫৫২২২
P 590
[2/28, 11:42 AM] Sanaullah: নাম:বিপ্লব 
থানা:সাভার মডেল থানা
ঠিকানা:সাভার বক্তারপুর আকসা জামে মসজিদ 
নাম্বার:01742744516
P 590
`;

  const whatsappPattern =
    /\[\d{1,2}\/\d{1,2},\s\d{1,2}:\d{2}\s(?:AM|PM|am|pm)\]\s[^:]+:\s?/g;

  const contents = inputText
    .split(whatsappPattern)
    .filter((content) => content.trim().length > 5);
    console.log(contents);
  return <div>Test</div>;
}

export default Test;
